<a href="https://colab.research.google.com/github/alyani-fr/demographic-data-analyzer/blob/main/boilerplate_demographic_data_analyzer.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('adult.data.csv')

In [3]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

- **How many of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.**

In [5]:
pd.read_csv('adult.data.csv', usecols=['race'])

        race
0      White
1      White
2      White
3      Black
4      Black
...      ...
32556  White
32557  White
32558  White
32559  White
32560  White

[32561 rows x 1 columns]

In [6]:
print(df['race'].unique())

['White' 'Black' 'Asian-Pac-Islander' 'Amer-Indian-Eskimo' 'Other']

In [7]:
race_counts = df['race'].value_counts()
print(race_counts)

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

- **What is the average age of men?**

In [8]:
df['sex'].unique()

array(['Male', 'Female'], dtype=object)

In [9]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [10]:
print(df['age'].unique())

[39 50 38 53 28 37 49 52 31 42 30 23 32 40 34 25 43 54 35 59 56 19 20 45
 22 48 21 24 57 44 41 29 18 47 46 36 79 27 67 33 76 17 55 61 70 64 71 68
 66 51 58 26 60 90 75 65 77 62 63 80 72 74 69 73 81 78 88 82 83 84 85 86
 87]

In [11]:
pd.read_csv('adult.data.csv', usecols=['age','sex'])

       age     sex
0       39    Male
1       50    Male
2       38    Male
3       53    Male
4       28  Female
...    ...     ...
32556   27  Female
32557   40    Male
32558   58  Female
32559   22    Male
32560   52  Female

[32561 rows x 2 columns]

In [12]:
grouped = df.groupby('sex')
df_grouped = grouped.get_group('Male')

print(df_grouped)

       age         workclass  fnlwgt     education  education-num  \
0       39         State-gov   77516     Bachelors             13
1       50  Self-emp-not-inc   83311     Bachelors             13
2       38           Private  215646       HS-grad              9
3       53           Private  234721          11th              7
7       52  Self-emp-not-inc  209642       HS-grad              9
...    ...               ...     ...           ...            ...
32553   32           Private  116138       Masters             14
32554   53           Private  321865       Masters             14
32555   22           Private  310152  Some-college             10
32557   40           Private  154374       HS-grad              9
32559   22           Private  201490       HS-grad              9

           marital-status         occupation   relationship  \
0           Never-married       Adm-clerical  Not-in-family
1      Married-civ-spouse    Exec-managerial        Husband
2                Divorced  Handlers-cleaners  Not-in-family
3      Married-civ-spouse  Handlers-cleaners        Husband
7      Married-civ-spouse    Exec-managerial        Husband
...                   ...                ...            ...
32553       Never-married       Tech-support  Not-in-family
32554  Married-civ-spouse    Exec-managerial        Husband
32555       Never-married    Protective-serv  Not-in-family
32557  Married-civ-spouse  Machine-op-inspct        Husband
32559       Never-married       Adm-clerical      Own-child

                     race   sex  capital-gain  capital-loss  hours-per-week  \
0                   White  Male          2174             0              40
1                   White  Male             0             0              13
2                   White  Male             0             0              40
3                   Black  Male             0             0              40
7                   White  Male             0             0              45
...                   ...   ...           ...           ...             ...
32553  Asian-Pac-Islander  Male             0             0              11
32554               White  Male             0             0              40
32555               White  Male             0             0              40
32557               White  Male             0             0              40
32559               White  Male             0             0              20

      native-country salary
0      United-States  <=50K
1      United-States  <=50K
2      United-States  <=50K
3      United-States  <=50K
7      United-States   >50K
...              ...    ...
32553         Taiwan  <=50K
32554  United-States   >50K
32555  United-States  <=50K
32557  United-States   >50K
32559  United-States  <=50K

[21790 rows x 15 columns]

In [13]:
df_grouped[['age','sex']]

       age   sex
0       39  Male
1       50  Male
2       38  Male
3       53  Male
7       52  Male
...    ...   ...
32553   32  Male
32554   53  Male
32555   22  Male
32557   40  Male
32559   22  Male

[21790 rows x 2 columns]

In [14]:
sum(df_grouped.value_counts())

21790

In [15]:
average_age_men = round(df_grouped['age'].mean(),1)
print(average_age_men)

39.4

In [16]:
print(df['education'].unique())

['Bachelors' 'HS-grad' '11th' 'Masters' '9th' 'Some-college' 'Assoc-acdm'
 'Assoc-voc' '7th-8th' 'Doctorate' 'Prof-school' '5th-6th' '10th'
 '1st-4th' 'Preschool' '12th']

- **What is the percentage of people who have a Bachelor's degree?**

In [17]:
degree = df.groupby('education')
df_degree = degree.get_group('Bachelors')

print(df_degree)

       age         workclass  fnlwgt  education  education-num  \
0       39         State-gov   77516  Bachelors             13
1       50  Self-emp-not-inc   83311  Bachelors             13
4       28           Private  338409  Bachelors             13
9       42           Private  159449  Bachelors             13
11      30         State-gov  141297  Bachelors             13
...    ...               ...     ...        ...            ...
32530   35                 ?  320084  Bachelors             13
32531   30                 ?   33811  Bachelors             13
32533   54           Private  337992  Bachelors             13
32536   34           Private  160216  Bachelors             13
32538   38           Private  139180  Bachelors             13

           marital-status       occupation   relationship                race  \
0           Never-married     Adm-clerical  Not-in-family               White
1      Married-civ-spouse  Exec-managerial        Husband               White
4      Married-civ-spouse   Prof-specialty           Wife               Black
9      Married-civ-spouse  Exec-managerial        Husband               White
11     Married-civ-spouse   Prof-specialty        Husband  Asian-Pac-Islander
...                   ...              ...            ...                 ...
32530  Married-civ-spouse                ?           Wife               White
32531       Never-married                ?  Not-in-family  Asian-Pac-Islander
32533  Married-civ-spouse  Exec-managerial        Husband  Asian-Pac-Islander
32536       Never-married  Exec-managerial  Not-in-family               White
32538            Divorced   Prof-specialty      Unmarried               Black

          sex  capital-gain  capital-loss  hours-per-week native-country  \
0        Male          2174             0              40  United-States
1        Male             0             0              13  United-States
4      Female             0             0              40           Cuba
9        Male          5178             0              40  United-States
11       Male             0             0              40          India
...       ...           ...           ...             ...            ...
32530  Female             0             0              55  United-States
32531  Female             0             0              99  United-States
32533    Male             0             0              50          Japan
32536  Female             0             0              55  United-States
32538  Female         15020             0              45  United-States

      salary
0      <=50K
1      <=50K
4      <=50K
9       >50K
11      >50K
...      ...
32530   >50K
32531  <=50K
32533   >50K
32536   >50K
32538   >50K

[5355 rows x 15 columns]

In [18]:
df_degree['education'].value_counts()

Bachelors    5355
Name: education, dtype: int64

In [19]:
a = sum(df_degree['education'].value_counts())
print(a)

5355

In [20]:
b = sum(df['education'].value_counts())
print(b)

32561

In [21]:
percentage_bachelors = (a / b) * 100
print(round(percentage_bachelors, 1))

16.4

- **Percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`)**

In [22]:
df['education'].unique()

array(['Bachelors', 'HS-grad', '11th', 'Masters', '9th', 'Some-college',
       'Assoc-acdm', 'Assoc-voc', '7th-8th', 'Doctorate', 'Prof-school',
       '5th-6th', '10th', '1st-4th', 'Preschool', '12th'], dtype=object)

In [23]:
df['education'].value_counts()

HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: education, dtype: int64

In [24]:
sum(df['education'].value_counts())

32561

In [25]:
higher_edu = df[df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])]

higher_edu.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K

In [26]:
higher_edu['education'].value_counts()

Bachelors    5355
Masters      1723
Doctorate     413
Name: education, dtype: int64

In [27]:
sum(higher_edu['education'].value_counts())

7491

In [28]:
higher_edu_percent = round((sum(higher_edu['education'].value_counts()) / sum(df['education'].value_counts())) * 100, 1)

print(higher_edu_percent)

23.0

- **Percentage of people without advanced education (`Bachelors`, `Masters`, or `Doctorate`)**

In [29]:
lower_edu = df[~df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])]

lower_edu.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
10,37,Private,280464,Some-college,10,Married-civ-spouse,Exec-managerial,Husband,Black,Male,0,0,80,United-States,>50K

In [30]:
lower_edu['education'].value_counts()

HS-grad         10501
Some-college     7291
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
5th-6th           333
1st-4th           168
Preschool          51
Name: education, dtype: int64

In [31]:
e = sum(lower_edu['education'].value_counts())
print(e)

25070

In [32]:
lower_edu_percent = round((sum(lower_edu['education'].value_counts()) / sum(df['education'].value_counts())) * 100, 1)

print(lower_edu_percent)

77.0

- **What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?**

In [33]:
df2 = pd.read_csv('adult.data.csv', usecols=['education','salary'])
print(df2)

        education salary
0       Bachelors  <=50K
1       Bachelors  <=50K
2         HS-grad  <=50K
3            11th  <=50K
4       Bachelors  <=50K
...           ...    ...
32556  Assoc-acdm  <=50K
32557     HS-grad   >50K
32558     HS-grad  <=50K
32559     HS-grad  <=50K
32560     HS-grad   >50K

[32561 rows x 2 columns]

In [34]:
df2.value_counts()

education     salary
HS-grad       <=50K     8826
Some-college  <=50K     5904
Bachelors     <=50K     3134
              >50K      2221
HS-grad       >50K      1675
Some-college  >50K      1387
11th          <=50K     1115
Assoc-voc     <=50K     1021
Masters       >50K       959
10th          <=50K      871
Assoc-acdm    <=50K      802
Masters       <=50K      764
7th-8th       <=50K      606
9th           <=50K      487
Prof-school   >50K       423
12th          <=50K      400
Assoc-voc     >50K       361
5th-6th       <=50K      317
Doctorate     >50K       306
Assoc-acdm    >50K       265
1st-4th       <=50K      162
Prof-school   <=50K      153
Doctorate     <=50K      107
10th          >50K        62
11th          >50K        60
Preschool     <=50K       51
7th-8th       >50K        40
12th          >50K        33
9th           >50K        27
5th-6th       >50K        16
1st-4th       >50K         6
dtype: int64

In [35]:
c = sum(higher_edu.value_counts())

In [36]:
higher_edu_rich = df[df['education'].isin(['Bachelors', 'Masters', 'Doctorate']) & df['salary'].str.contains('>50K')]

print(higher_edu_rich)

       age         workclass  fnlwgt  education  education-num  \
8       31           Private   45781    Masters             14
9       42           Private  159449  Bachelors             13
11      30         State-gov  141297  Bachelors             13
19      43  Self-emp-not-inc  292175    Masters             14
20      40           Private  193524  Doctorate             16
...    ...               ...     ...        ...            ...
32533   54           Private  337992  Bachelors             13
32536   34           Private  160216  Bachelors             13
32538   38           Private  139180  Bachelors             13
32539   71                 ?  287372  Doctorate             16
32554   53           Private  321865    Masters             14

           marital-status       occupation   relationship                race  \
8           Never-married   Prof-specialty  Not-in-family               White
9      Married-civ-spouse  Exec-managerial        Husband               White
11     Married-civ-spouse   Prof-specialty        Husband  Asian-Pac-Islander
19               Divorced  Exec-managerial      Unmarried               White
20     Married-civ-spouse   Prof-specialty        Husband               White
...                   ...              ...            ...                 ...
32533  Married-civ-spouse  Exec-managerial        Husband  Asian-Pac-Islander
32536       Never-married  Exec-managerial  Not-in-family               White
32538            Divorced   Prof-specialty      Unmarried               Black
32539  Married-civ-spouse                ?        Husband               White
32554  Married-civ-spouse  Exec-managerial        Husband               White

          sex  capital-gain  capital-loss  hours-per-week native-country  \
8      Female         14084             0              50  United-States
9        Male          5178             0              40  United-States
11       Male             0             0              40          India
19     Female             0             0              45  United-States
20       Male             0             0              60  United-States
...       ...           ...           ...             ...            ...
32533    Male             0             0              50          Japan
32536  Female             0             0              55  United-States
32538  Female         15020             0              45  United-States
32539    Male             0             0              10  United-States
32554    Male             0             0              40  United-States

      salary
8       >50K
9       >50K
11      >50K
19      >50K
20      >50K
...      ...
32533   >50K
32536   >50K
32538   >50K
32539   >50K
32554   >50K

[3486 rows x 15 columns]

In [37]:
d = sum(higher_edu_rich.value_counts())

In [38]:
print(round((d / c) * 100, 1))

46.5

- **What percentage of people without advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?**

In [39]:
lower_edu_rich = df[~df['education'].isin(['Bachelors', 'Masters', 'Doctorate']) & df['salary'].str.contains('>50K')]
print(lower_edu_rich)

       age         workclass  fnlwgt     education  education-num  \
7       52  Self-emp-not-inc  209642       HS-grad              9
10      37           Private  280464  Some-college             10
14      40           Private  121772     Assoc-voc             11
27      54                 ?  180211  Some-college             10
38      31           Private   84154  Some-college             10
...    ...               ...     ...           ...            ...
32518   57         Local-gov  110417       HS-grad              9
32519   46           Private  364548  Some-college             10
32545   39         Local-gov  111499    Assoc-acdm             12
32557   40           Private  154374       HS-grad              9
32560   52      Self-emp-inc  287927       HS-grad              9

           marital-status         occupation relationship                race  \
7      Married-civ-spouse    Exec-managerial      Husband               White
10     Married-civ-spouse    Exec-managerial      Husband               Black
14     Married-civ-spouse       Craft-repair      Husband  Asian-Pac-Islander
27     Married-civ-spouse                  ?      Husband  Asian-Pac-Islander
38     Married-civ-spouse              Sales      Husband               White
...                   ...                ...          ...                 ...
32518  Married-civ-spouse       Craft-repair      Husband               White
32519  Married-civ-spouse    Exec-managerial      Husband               White
32545  Married-civ-spouse       Adm-clerical         Wife               White
32557  Married-civ-spouse  Machine-op-inspct      Husband               White
32560  Married-civ-spouse    Exec-managerial         Wife               White

          sex  capital-gain  capital-loss  hours-per-week native-country  \
7        Male             0             0              45  United-States
10       Male             0             0              80  United-States
14       Male             0             0              40              ?
27       Male             0             0              60          South
38       Male             0             0              38              ?
...       ...           ...           ...             ...            ...
32518    Male         99999             0              40  United-States
32519    Male             0             0              48  United-States
32545  Female             0             0              20  United-States
32557    Male             0             0              40  United-States
32560  Female         15024             0              40  United-States

      salary
7       >50K
10      >50K
14      >50K
27      >50K
38      >50K
...      ...
32518   >50K
32519   >50K
32545   >50K
32557   >50K
32560   >50K

[4355 rows x 15 columns]

In [40]:
f = sum(lower_edu_rich.value_counts())
print(f)

4355

In [41]:
print(round((f / e) * 100, 1))

17.4

- **What is the minimum number of hours a person works per week (hours-per-week feature)?**

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [43]:
min(df[['hours-per-week']].value_counts())

1

- **What percentage of the people who work the minimum number of hours per week have a salary of >50K?**

In [44]:
df3 = pd.read_csv('adult.data.csv', usecols=['hours-per-week','salary'])
print(df3)

       hours-per-week salary
0                  40  <=50K
1                  13  <=50K
2                  40  <=50K
3                  40  <=50K
4                  40  <=50K
...               ...    ...
32556              38  <=50K
32557              40   >50K
32558              40  <=50K
32559              20  <=50K
32560              40   >50K

[32561 rows x 2 columns]

In [45]:
min(df[['hours-per-week']].value_counts())

1

In [46]:
rich = df[df['hours-per-week'].isin([1]) & df['salary'].str.contains('>50K')]
print(rich)

       age  workclass  fnlwgt  education  education-num      marital-status  \
189     58  State-gov  109567  Doctorate             16  Married-civ-spouse
20072   65          ?   76043    HS-grad              9  Married-civ-spouse

           occupation relationship   race   sex  capital-gain  capital-loss  \
189    Prof-specialty      Husband  White  Male             0             0
20072               ?      Husband  White  Male             0             0

       hours-per-week native-country salary
189                 1  United-States   >50K
20072               1  United-States   >50K

In [47]:
g = sum(rich.value_counts())

In [48]:
vary_salary = df[df['hours-per-week'].isin([1]) & df['salary']]
print(vary_salary)

       age         workclass  fnlwgt     education  education-num  \
189     58         State-gov  109567     Doctorate             16
1036    66      Self-emp-inc  150726           9th              5
1262    69                 ?  195779     Assoc-voc             11
5590    78                 ?  363134       HS-grad              9
5632    45                 ?  189564       Masters             14
5766    62                 ?   97231  Some-college             10
5808    76                 ?  211574          10th              6
8447    67                 ?  244122     Assoc-voc             11
9147    75                 ?  260543          10th              6
11451   27           Private  147951       HS-grad              9
19337   72                 ?   76860       HS-grad              9
19750   23           Private   72887       HS-grad              9
20072   65                 ?   76043       HS-grad              9
20909   77  Self-emp-not-inc   71676  Some-college             10
22960   21           Private  184135       HS-grad              9
23536   69                 ?  320280  Some-college             10
24284   57  Self-emp-not-inc   56480       HS-grad              9
25078   74           Private  260669          10th              6
29752   69                 ?  117525    Assoc-acdm             12
32525   81                 ?  120478     Assoc-voc             11

           marital-status         occupation    relationship  \
189    Married-civ-spouse     Prof-specialty         Husband
1036   Married-civ-spouse    Exec-managerial         Husband
1262              Widowed                  ?   Not-in-family
5590              Widowed                  ?   Not-in-family
5632   Married-civ-spouse                  ?            Wife
5766   Married-civ-spouse                  ?            Wife
5808   Married-civ-spouse                  ?         Husband
8447              Widowed                  ?   Not-in-family
9147              Widowed                  ?  Other-relative
11451       Never-married  Machine-op-inspct  Other-relative
19337  Married-civ-spouse                  ?         Husband
19750       Never-married       Craft-repair       Own-child
20072  Married-civ-spouse                  ?         Husband
20909             Widowed       Adm-clerical   Not-in-family
22960       Never-married  Machine-op-inspct       Own-child
23536       Never-married                  ?   Not-in-family
24284  Married-civ-spouse    Exec-managerial         Husband
25078            Divorced      Other-service   Not-in-family
29752            Divorced                  ?       Unmarried
32525            Divorced                  ?       Unmarried

                     race     sex  capital-gain  capital-loss  hours-per-week  \
189                 White    Male             0             0               1
1036                White    Male          1409             0               1
1262                White  Female             0             0               1
5590                White  Female             0             0               1
5632                White  Female             0             0               1
5766                White  Female             0             0               1
5808                White    Male             0             0               1
8447                White  Female             0             0               1
9147   Asian-Pac-Islander  Female             0             0               1
11451               White    Male             0             0               1
19337  Asian-Pac-Islander    Male             0             0               1
19750  Asian-Pac-Islander    Male             0             0               1
20072               White    Male             0             0               1
20909               White  Female             0          1944               1
22960               Black    Male             0             0               1
23536               White    Male          1848             0               1
24284               White    Male             0             0               1
25078               White  Female             0             0               1
29752               White  Female             0             0               1
32525               White  Female             0             0               1

      native-country salary
189    United-States   >50K
1036               ?  <=50K
1262   United-States  <=50K
5590   United-States  <=50K
5632   United-States  <=50K
5766   United-States  <=50K
5808   United-States  <=50K
8447   United-States  <=50K
9147           China  <=50K
11451  United-States  <=50K
19337  United-States  <=50K
19750        Vietnam  <=50K
20072  United-States   >50K
20909  United-States  <=50K
22960  United-States  <=50K
23536  United-States  <=50K
24284  United-States  <=50K
25078  United-States  <=50K
29752  United-States  <=50K
32525              ?  <=50K

In [49]:
h = sum(vary_salary.value_counts())

In [50]:
print(round((g / h) * 100, 1))

10.0

- **What country has the highest percentage of people that earn >50K?**

In [51]:
df4 = pd.read_csv('adult.data.csv', usecols=['native-country','salary'])
print(df4)

      native-country salary
0      United-States  <=50K
1      United-States  <=50K
2      United-States  <=50K
3      United-States  <=50K
4               Cuba  <=50K
...              ...    ...
32556  United-States  <=50K
32557  United-States   >50K
32558  United-States  <=50K
32559  United-States  <=50K
32560  United-States   >50K

[32561 rows x 2 columns]

In [52]:
no_null = df4.drop(df4.index[(df4['native-country'] == '?')],axis=0)
print(no_null)
print(type(no_null))

      native-country salary
0      United-States  <=50K
1      United-States  <=50K
2      United-States  <=50K
3      United-States  <=50K
4               Cuba  <=50K
...              ...    ...
32556  United-States  <=50K
32557  United-States   >50K
32558  United-States  <=50K
32559  United-States  <=50K
32560  United-States   >50K

[31978 rows x 2 columns]
<class 'pandas.core.frame.DataFrame'>

In [53]:
highest_earn_country = no_null[no_null['salary'].isin(['>50K']) & no_null['native-country']]
print(highest_earn_country)

      native-country salary
7      United-States   >50K
8      United-States   >50K
9      United-States   >50K
10     United-States   >50K
11             India   >50K
...              ...    ...
32539  United-States   >50K
32545  United-States   >50K
32554  United-States   >50K
32557  United-States   >50K
32560  United-States   >50K

[7695 rows x 2 columns]

In [54]:
highest_earn_country['native-country'].value_counts()

United-States         7171
Philippines             61
Germany                 44
India                   40
Canada                  39
Mexico                  33
England                 30
Italy                   25
Cuba                    25
Japan                   24
Taiwan                  20
China                   20
Iran                    18
South                   16
Puerto-Rico             12
Poland                  12
France                  12
Jamaica                 10
El-Salvador              9
Greece                   8
Cambodia                 7
Hong                     6
Yugoslavia               6
Ireland                  5
Vietnam                  5
Portugal                 4
Haiti                    4
Ecuador                  4
Thailand                 3
Hungary                  3
Guatemala                3
Scotland                 3
Nicaragua                2
Trinadad&Tobago          2
Laos                     2
Columbia                 2
Dominican-Republic       2
Peru                     2
Honduras                 1
Name: native-country, dtype: int64

In [55]:
max(highest_earn_country.value_counts())

7171

In [56]:
# highest earning country
highest_earn_country['native-country'].value_counts().index.tolist()[0]

'United-States'

In [57]:
# highest earning country percentage
i = sum(highest_earn_country.value_counts()) 
print(i)

7695

In [58]:
vary_earn_country = no_null[no_null['salary'].isin(['>50K','<=50K']) & no_null['native-country']]
print(vary_earn_country)

      native-country salary
0      United-States  <=50K
1      United-States  <=50K
2      United-States  <=50K
3      United-States  <=50K
4               Cuba  <=50K
...              ...    ...
32556  United-States  <=50K
32557  United-States   >50K
32558  United-States  <=50K
32559  United-States  <=50K
32560  United-States   >50K

[31978 rows x 2 columns]

In [59]:
vary_earn_country.value_counts()['Iran']

salary
<=50K    25
>50K     18
dtype: int64

- **Identify the most popular occupation for those who earn >50K in India.**

In [60]:
df5 = pd.read_csv('adult.data.csv', usecols=['native-country','salary','occupation'])
print(df5)

              occupation native-country salary
0           Adm-clerical  United-States  <=50K
1        Exec-managerial  United-States  <=50K
2      Handlers-cleaners  United-States  <=50K
3      Handlers-cleaners  United-States  <=50K
4         Prof-specialty           Cuba  <=50K
...                  ...            ...    ...
32556       Tech-support  United-States  <=50K
32557  Machine-op-inspct  United-States   >50K
32558       Adm-clerical  United-States  <=50K
32559       Adm-clerical  United-States  <=50K
32560    Exec-managerial  United-States   >50K

[32561 rows x 3 columns]

In [61]:
df5['occupation'].value_counts()

Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
?                    1843
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

In [62]:
most_popular_india = df5[df5['salary'].isin(['>50K']) & df5['native-country'].isin(['India']) & df5['occupation']]
print(most_popular_india)

             occupation native-country salary
11       Prof-specialty          India   >50K
968     Exec-managerial          India   >50K
1327      Other-service          India   >50K
7258     Prof-specialty          India   >50K
7285     Prof-specialty          India   >50K
8124     Prof-specialty          India   >50K
9939     Prof-specialty          India   >50K
10590    Prof-specialty          India   >50K
10661    Prof-specialty          India   >50K
10736    Prof-specialty          India   >50K
11260    Prof-specialty          India   >50K
11384      Tech-support          India   >50K
13422   Exec-managerial          India   >50K
13551   Exec-managerial          India   >50K
13862   Exec-managerial          India   >50K
16017   Exec-managerial          India   >50K
16778   Exec-managerial          India   >50K
16923     Other-service          India   >50K
17259    Prof-specialty          India   >50K
17834  Transport-moving          India   >50K
20417   Exec-managerial          India   >50K
20465    Prof-specialty          India   >50K
21128    Prof-specialty          India   >50K
23474    Prof-specialty          India   >50K
24154             Sales          India   >50K
25739    Prof-specialty          India   >50K
26305      Tech-support          India   >50K
26356   Exec-managerial          India   >50K
27670    Prof-specialty          India   >50K
28264    Prof-specialty          India   >50K
28433    Prof-specialty          India   >50K
28452    Prof-specialty          India   >50K
28557    Prof-specialty          India   >50K
28651    Prof-specialty          India   >50K
28798    Prof-specialty          India   >50K
30111    Prof-specialty          India   >50K
30152    Prof-specialty          India   >50K
30833      Adm-clerical          India   >50K
31327    Prof-specialty          India   >50K
31357    Prof-specialty          India   >50K

In [63]:
most_popular_india['occupation'].value_counts().index.tolist()[0]

'Prof-specialty'